// Задача №4
// Напишите программу, которая на вход принимает натуральное число N,
// а на выход показывает его цифры через запятую.

Console.WriteLine("Input N: ");
int n = Convert.ToInt32(Console.ReadLine());
int start = n  10;
while()
{
    
}